#!/usr/bin/env bash
set -euo pipefail

# ==============================================================================
# Download Module
# ==============================================================================
# 离线资源下载模块
# ==============================================================================

source "${KUBEXM_ROOT}/internal/task/common.sh"
source "${KUBEXM_ROOT}/internal/task/infra/download/main.sh"

# -----------------------------------------------------------------------------
# 下载资源
# -----------------------------------------------------------------------------
module::download() {
  local ctx="$1"
  shift
  task::download_resources "${ctx}" "$@"
}

export -f module::download